In [ ]:
# Pandas
# Dataframe : Estructura de datos de pandas, muy similar a una tabla o hoja de excel donde tendras
# Filas y Columas

In [ ]:
# Importamos el pandas
import pandas as pd

'''
    Lista --- []
    Dict --- {}
    Tupla --- ()
'''

# Crear un dataframe desde una lista
data = [['Juan', 25], ['Pedro', 34], ['Luis', 45]]

df = pd.DataFrame(data, columns = ['Nombre', 'Edad'])

In [5]:
df

  Nombre  Edad
0   Juan    25
1  Pedro    34
2   Luis    45

In [6]:
# Crear un dataframe desde un diccionario
data = {
    'Nombre': ['Juan', 'Pedro', 'Luis'],
    'Edad': [25, 26, 34]
}
df = pd.DataFrame(data)

In [7]:
df

  Nombre  Edad
0   Juan    25
1  Pedro    26
2   Luis    34